Revit 2024 API
DockablePaneId.Equality Operator
Compares two DockablePaneId instances.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool operator ==(
	DockablePaneId first,
	DockablePaneId second
)
Visual Basic
Public Shared Operator = ( _
	first As DockablePaneId, _
	second As DockablePaneId _
) As Boolean
Visual C++
public:
static bool operator ==(
	DockablePaneId^ first,
	DockablePaneId^ second
)
Parameters
first
Type: Autodesk.Revit.UI.DockablePaneId
The first DockablePaneId.
second
Type: Autodesk.Revit.UI.DockablePaneId
The second DockablePaneId.
Return Value
True if the inputs are identical, false if they are different.
See Also
DockablePaneId Class
Autodesk.Revit.UI Namespace